# 데이터프레임의 데이터 조작

In [12]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [5]:
s.count(), s.size

(9, 10)

In [10]:
df = pd.DataFrame(data=np.arange(16).reshape(4,4), dtype=float)
df.iloc[2,3] = np.nan
df

      0     1     2     3
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0   NaN
3  12.0  13.0  14.0  15.0

In [11]:
df.count(), df.size

(0    4
 1    4
 2    4
 3    3
 dtype: int64, 16)

In [13]:
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [14]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [15]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [16]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [24]:
categorical_columns = set(titanic.columns.values).difference(set(titanic.describe().columns.values))
print(categorical_columns)
print()
titanic[categorical_columns].describe()

{'embark_town', 'adult_male', 'class', 'alone', 'who', 'embarked', 'deck', 'sex', 'alive'}

        embark_town adult_male  class alone  who embarked deck   sex alive
count           889        891    891   891  891      889  203   891   891
unique            3          2      3     2    3        3    7     2     2
top     Southampton       True  Third  True  man        S    C  male    no
freq            644        537    491   537  537      644   59   577   549

### 카테고리 값 세기

In [25]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [27]:
gender, count = np.unique(titanic.sex, return_counts=True)
print(gender)
print(count)

['female' 'male']
[314 577]

### 정렬

In [31]:
titanic.pclass.value_counts().sort_values()

2    184
1    216
3    491
Name: pclass, dtype: int64

In [35]:
np.random.seed(2021)
s2 = pd.Series(np.random.randint(10, size=100))
s2

0     4
1     5
2     9
3     0
4     6
     ..
95    9
96    6
97    9
98    3
99    9
Length: 100, dtype: int64

In [36]:
s2.value_counts().sort_values()

8     3
0     7
4     9
2     9
1    10
7    11
3    11
5    12
6    13
9    15
dtype: int64

In [37]:
s2.value_counts().sort_values(ascending=False)

9    15
6    13
5    12
3    11
7    11
1    10
2     9
4     9
0     7
8     3
dtype: int64

In [45]:
s2.value_counts().sort_index(ascending=False)

9    15
8     3
7    11
6    13
5    12
4     9
3    11
2     9
1    10
0     7
dtype: int64

In [42]:
titanic.sort_values(by='fare', ascending=False).head()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
258         1       1  female  35.0  ...   NaN    Cherbourg    yes   True
737         1       1    male  35.0  ...     B    Cherbourg    yes   True
679         1       1    male  36.0  ...     B    Cherbourg    yes  False
88          1       1  female  23.0  ...     C  Southampton    yes  False
27          0       1    male  19.0  ...     C  Southampton     no  False

[5 rows x 15 columns]

In [43]:
titanic.sort_values(by=['fare', 'age'], ascending=False).head()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
679         1       1    male  36.0  ...     B    Cherbourg    yes  False
258         1       1  female  35.0  ...   NaN    Cherbourg    yes   True
737         1       1    male  35.0  ...     B    Cherbourg    yes   True
438         0       1    male  64.0  ...     C  Southampton     no  False
341         1       1  female  24.0  ...     C  Southampton    yes  False

[5 rows x 15 columns]

### 행/열 합계

In [46]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [49]:
df2.sum()   # default가 0

0    19
1    21
2    20
3     5
4    18
5    19
6    16
7    19
dtype: int64

In [50]:
df2.sum(axis=1)

0    43
1    33
2    19
3    42
dtype: int64

In [51]:
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  4  5  9  0  6  5  8  6      43
1  6  6  6  1  5  7  1  1      33
2  5  2  0  3  1  0  2  6      19
3  4  8  5  1  6  7  5  6      42

In [52]:
df2.loc['ColSum', :] = df2.sum()
df2

           0     1     2    3     4     5     6     7  RowSum
0        4.0   5.0   9.0  0.0   6.0   5.0   8.0   6.0    43.0
1        6.0   6.0   6.0  1.0   5.0   7.0   1.0   1.0    33.0
2        5.0   2.0   0.0  3.0   1.0   0.0   2.0   6.0    19.0
3        4.0   8.0   5.0  1.0   6.0   7.0   5.0   6.0    42.0
ColSum  19.0  21.0  20.0  5.0  18.0  19.0  16.0  19.0   137.0

타이타닉호 승객의 평균 나이를 구하라.

타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [53]:
titanic.age.mean()

29.69911764705882

In [58]:
round(titanic.loc[titanic.sex=='female', 'age'].mean(), 1)

27.9

In [59]:
round(titanic.loc[np.logical_and(titanic.sex=='female', titanic.pclass==1), 'age'].mean(), 1)

34.6

In [67]:
round(titanic.loc[(titanic.pclass==1) & (titanic.sex=='female'), 'age'].mean(), 1)

34.6

In [70]:
import warnings 
warnings.filterwarnings('ignore')    # 코드 결과에서 warnings가 안나온다

## apply 변환 : 데이터프레임의 map이다

In [71]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [72]:
df3.apply(lambda x : max(x) - min(x), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [73]:
df3.apply(lambda x : x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [74]:
df3.apply(lambda x : x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [75]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [78]:
titanic['adult/child'] = titanic.apply(lambda r : '성년' if r.age >=20 else '미성년', axis=1)
titanic[['age', 'adult/child']].head()

    age adult/child
0  22.0          성년
1  38.0          성년
2  26.0          성년
3  35.0          성년
4  35.0          성년

### 연습문제 4.4.4

In [79]:
titanic['category'] = np.where(titanic['age'] < 20, 'child', titanic['sex'])

### fillna method

In [80]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [81]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [82]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [84]:
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.
titanic['age'].isnull().sum()

177

In [85]:
titanic['age'].fillna(titanic['age'].mean(), inplace=True)

## astype() method

In [87]:
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

## 실수 값을 카테고리 값으로 변환

In [88]:
ages = ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [90]:
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '중년', '장년', '노년']
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [91]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [92]:
np.random.seed(2021)
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=['q1','q2','q3','q4'])
cats

['q4', 'q3', 'q2', 'q1', 'q3', ..., 'q3', 'q1', 'q4', 'q2', 'q2']
Length: 1000
Categories (4, object): ['q1' < 'q2' < 'q3' < 'q4']

In [93]:
pd.value_counts(cats)

q4    250
q3    250
q2    250
q1    250
dtype: int64